# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-02-27 15:13:34 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Pythia
  Pythia aims to be a desktop search engine, like Beagle or Tracker.
  Pythia is named after the title of the priestress at the ancient Oracle of
  Delphi. Before Apollo claimed the site, it was inhabited by a giant
  snake/dragon named Python, which is where the giant snakes get their name
  from, and ultimately the programming language Python as well (via Monty
  Python).
** Clocktable
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2024-02-27 Di 15:13]
   | Headline               | Time    |         |      |      |
   |------------------------+---------+---------+------+------|
   | *Total time*           | *16:19* |         |      |      |
   |------------------------+---------+---------+------+------|
   | *Pythia*               | *16:19* |         |      |      |
   | \_  /Components [1/6]/ |         | /16:19/ |      |      |
   | \_    Data types [0/0] |         |         | 2:59 |      |
   | \_    Database [0/0]   |         |         | 7:27 |      |
   | \_    Crawler [1/1]    |         |         | 3:47 |      |
   | \_      Blacklist      |         |         |      | 0:32 |
   | \_    Extractors [0/5] |         |         | 2:06 |      |
   | \_      PDF            |         |         |      | 1:00 |
   | \_      Audio          |         |         |      | 0:20 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [1/6]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Data types [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-22 Do 17:26]--[2024-02-22 Do 17:27] =>  0:01
    CLOCK: [2024-02-21 Mi 14:52]--[2024-02-21 Mi 17:50] =>  2:58
    :END:
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-24 Sa 15:01]--[2024-02-24 Sa 15:25] =>  0:24
    CLOCK: [2024-02-23 Fr 19:25]--[2024-02-23 Fr 22:08] =>  2:43
    CLOCK: [2024-02-23 Fr 15:52]--[2024-02-23 Fr 18:38] =>  2:46
    CLOCK: [2024-02-22 Do 18:05]--[2024-02-22 Do 19:05] =>  1:00
    CLOCK: [2024-02-22 Do 17:27]--[2024-02-22 Do 18:01] =>  0:34
    :END:
*** Crawler [1/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-24 Sa 15:45]--[2024-02-24 Sa 17:16] =>  1:31
    CLOCK: [2024-02-23 Fr 13:14]--[2024-02-23 Fr 13:14] =>  0:00
    CLOCK: [2024-02-23 Fr 08:55]--[2024-02-23 Fr 09:14] =>  0:19
    CLOCK: [2024-02-22 Do 19:10]--[2024-02-22 Do 20:35] =>  1:25
    :END:
**** DONE Blacklist
     CLOSED: [2024-02-24 Sa 20:26]
     :LOGBOOK:
     CLOCK: [2024-02-23 Fr 15:35]--[2024-02-23 Fr 15:52] =>  0:17
     CLOCK: [2024-02-23 Fr 13:14]--[2024-02-23 Fr 13:29] =>  0:15
     :END:
*** MEDITATE Extractors [0/5]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-02-26 Mo 19:25]--[2024-02-26 Mo 20:07] =>  0:42
    CLOCK: [2024-02-26 Mo 18:15]--[2024-02-26 Mo 18:19] =>  0:04
    :END:
    Extractors attempt to get text content from various file formats.
    I need to think about what kind of interface I want.
**** TODO Office documents
**** TODO Images
**** TODO PDF
     :LOGBOOK:
     CLOCK: [2024-02-26 Mo 18:19]--[2024-02-26 Mo 19:19] =>  1:00
     :END:
**** TODO Audio
     :LOGBOOK:
     CLOCK: [2024-02-27 Di 14:53]--[2024-02-27 Di 15:13] =>  0:20
     :END:
     Mutagen kann ich dafür verwenden, das habe ich ja schon einmal benutzt.
**** TODO Text files
*** UI [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    I have been thinking about trying out Qt5 or Qt6 which have Python
    bindings. I used Qt4 in C++ years ago for a few toy projects, and I
    remember the experience as being rather nice.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
